//-----------------------------------------------------------------------------
//  使用时请保留该信息，非常感谢
//-----------------------------------------------------------------------------
//  角色设定生成器
//  Character Generator
//
//  作者：熊豆(kumame)
//  站点：https://github.com/kumame/Tools
//-----------------------------------------------------------------------------

//数据版本，至少比当前版本+1，用于更新浏览器本地储存的数据。
DBversion = 1 ;


//坐标图片尺寸
var mapsize=250;

//坐标阈值，影响选中点的范围容差，不建议过大也不建议小于5
var ZBYZ = 10;

//种族模块开关:1=开，0=关
var RACE = 1;
//混血概率，0 为关闭
var hybrid = 70;
//允许混血的界限  根据力量来，只有强大力量才允许混血
var hybridRF = 80;
//允许混血的基底种族在数据库的位置
var Embryo = 1;

//身高(cm)以热带区域身高作为参考，会根据两极纬度进行计算，越接近寒冷地区越高
var heightMIN= 145;
var heightMAX= 181;
//热带 位于数据库位置
var REDAI = 3;

//异色瞳概率，根据RF坐标增加，0为关闭
var EYCL123 = 0.4;

//发色渐变、挑染概率，（Character.age,Power）根据Age减少或根据力量坐标增加，0为关闭
var H_B_CG= [3,0.5] ;
